<?php

namespace App\Console\Commands;

use Illuminate\Support\Carbon;
use Illuminate\Console\Command;
use PhpMqtt\Client\Facades\MQTT;
use Illuminate\Support\Facades\Log;
use PhpMqtt\Client\Exceptions\MqttClientException;
use PhpMqtt\Client\Exceptions\RepositoryException;
use PhpMqtt\Client\Exceptions\DataTransferException;
use PhpMqtt\Client\Exceptions\InvalidMessageException;
use PhpMqtt\Client\Exceptions\ProtocolViolationException;
use PhpMqtt\Client\Exceptions\ClientNotConnectedToBrokerException;

class HappyBirdMqttClient extends Command
{
    /**
     * The name and signature of the console command.
     *
     * @var string
     */
    protected $signature = 'happy-bird-mqtt-client:start';

    /**
     * The console command description.
     *
     * @var string
     */
    protected $description = 'Starts a happy bird MQTT client';

    protected array $warmTypes = [
        0   => '网络传输故障',
        1   => '主电故障(停止)',
        2   => '备电故障(停止)',
        3   => '通讯故障(掉线)',
        4   => '传感器短路、断路',
        5   => '漏电过大',
        6   => '温度过高',
        7   => '电弧报警',
        9   => '环境温湿度传感器短路、断路',
        22  => '复位',
        23  => '自检',
        24  => '启动',
        25  => '消音',
        26  => '开机',
        27  => '设备数变化',
        28  => '重发次数修改',
        29  => '清空数据',
        30  => '电流过大',
        31  => '电源断电',
        32  => '缺相',
        33  => '电压过低',
        34  => '电压过高',
        35  => '错相',
        55  => '探测器故障',
        56  => '触点开路',
        57  => '线路故障',
        58  => '短路隔离',
        59  => '总线欠压',
        60  => '输出故障',
        61  => '线路#1开路',
        62  => '线路#2开路',
        63  => '输入故障',
        64  => '电缆故障',
        65  => '线路短路',
        66  => '线路#1短路',
        67  => '线路#2短路',
        68  => 'EPPROM 故障',
        69  => '消火栓启动[1]',
        70  => '报警灯点亮',
        71  => '声光启动',
        72  => '启动喷洒',
        73  => '#2启动',
        74  => '调整失败',
        75  => '转换为自动',
        76  => '动作失败',
        77  => '转换至手动',
        78  => '烟I级火警',
        79  => '烟II级火警',
        80  => '手动报警（不推送）',
        81  => '消火栓启动[2]',
        82  => '输入反馈',
        83  => '线路#1反馈',
        84  => '反馈',
        85  => '直控点反馈',
        86  => '紧急启动',
        87  => '温II级火警',
        88  => '监管报警',
        89  => '输入火警[1]',
        90  => '喷洒',
        91  => '温I级火警',
        92  => '线路#2反馈',
        93  => '#1#2反馈',
        94  => '输入火警[2]',
        95  => '复合火警',
        96  => '屏蔽',
        97  => '火警',
        98  => '故障',
        99  => '联动',
        100 => '可撤销预警',
        101 => '可撤销火警',
        102 => '#1延时启动',
        103 => '#1延时停止',
        104 => '延时启动',
        105 => '#2延时启动',
        106 => '#2延时停止',
        107 => '延时结束',
        108 => '延时烟I级',
        109 => '延时烟II级',
        110 => '延时火警[1]',
        111 => '延时火警[2]',
        112 => '延时温I级',
        113 => '延时温II级',
        114 => '延时复合警',
        115 => '主电欠压',
        116 => '备电欠压',
        117 => '打印机故障',
        118 => '系统上电',
        119 => '水位过高',
        120 => '水位过低',
        121 => '水压过大',
        122 => '水压过低',
        123 => '可燃气体泄漏',
        124 => '烟感电量低',
        125 => '底座被拆除',
        126 => '烟感与底座失联',
        127 => '底座温度传感器故障',
        128 => '底座电压低',
        129 => '底座其他故障',
        130 => '烟感故障',
        132 => '电流互感穿心方向',
        133 => '电压不平衡',
        134 => '电流不平衡',
        135 => '电流穿心方向错误',
        136 => '报警',
        137 => '对内输入2报警',
        138 => '对内输入3报警',
        139 => '对内输入4报警',
        140 => '控制器连接断开',
        141 => '电源故障',
        142 => '报警，有人出入',
        143 => '报警，无人值守',
        144 => '电压短路',
        145 => '大功率负载报警',
        146 => '防火门通讯故障(掉线)',
        147 => '防火门故障',
        148 => '闭门器电源故障',
        149 => '防火门主电故障',
        150 => '防火门备电故障',
        151 => '回路短路(防火门)',
        152 => '回路掉线(防火门)',
        153 => '火灾控制器启动',
        154 => '火灾报警器回路故障',
        155 => '手动启动',
        156 => '消防电源监控主机主电故障',
        157 => '消防电源监控主机备电故障',
        158 => '通讯故障',
        159 => '过压',
        160 => '欠压',
        161 => '缺相',
        162 => '电源中断',
        163 => '过载',
        164 => '故障报警',
        165 => '开关断开',
        166 => '脱扣报警',
        167 => '低电量报警',
        168 => '功率过大',
        169 => '配置改变',
        170 => '确认',
        171 => '测试',
        172 => '与监控中心通信信道故障',
        173 => '监测连续线路故障',
        174 => '查岗应答',
        175 => '手动关闭',
        176 => '压力传感器故障',
        177 => '压力过低',
        178 => '压力过高',
        179 => '电池电压低',
        180 => '撞击',
        181 => '开盖',
        182 => '撞击传感器故障',
        183 => '漏水',
        184 => '放水',
        185 => '放水传感器故障',
        186 => '传感器故障',
        187 => '余额不足',
        188 => '磁干扰',
        189 => '阀门异常',
        190 => '停产异常',
        191 => '限产异常',
        192 => '电量异常',
        193 => '功率异常',
        194 => '治污设备停机异常',
        195 => '湿度高于阈值',
        196 => '湿度低于阈值',
        197 => '温度低于阈值',
        198 => '温度高于阈值',
        199 => '机组故障',
        200 => '设备电源断电',
        201 => '短路跳闸',
        202 => '漏保自检后自动合闸',
        203 => '手动合闸',
        204 => '手动关闸',
        205 => '本地按钮漏电自检',
        206 => '远程漏电自检',
        207 => '过压脱扣',
        208 => '欠压脱扣',
        209 => '突变报警',
        210 => '突变脱扣',
        211 => '相位角报警',
        212 => '相位角脱扣',
        213 => '大功率负载脱扣',
        214 => '视在功率报警',
        215 => '视在功率脱扣',
        216 => '有功功率报警',
        217 => '有功功率脱扣',
        218 => '无功功率报警',
        219 => '无功功率脱扣',
        220 => '电弧脱扣',
        221 => '功率因数报警',
        222 => '功率因数脱扣',
        223 => '欠压恢复自动合闸',
        224 => '过压恢复自动合闸',
        225 => '火警手动解除',
        226 => '火警自动解除',
        227 => '充电',
        228 => '开关闭合',
        229 => '探头短路',
        230 => '探头断路',
        231 => '探头老化',
        232 => '未标定',
        233 => '零点变化',
        234 => '无响应',
        235 => '预报警',
        236 => '低限报警',
        237 => '高限报警',
        238 => '水浸报警',
        239 => '负载异常',
        240 => '输入设备未连接',
        241 => '输出反馈',
        242 => '手动报警',
        243 => '绝缘电阻报警',
        244 => '变化率告警',
        245 => '撞到告警',
        246 => '振动告警',
        247 => '阀门打开告警',
        248 => '设备端盖告警',
        249 => 'DI输入操作',
        250 => '本地消音操作',
        251 => '本地自检操作',
        252 => '本地设置参数操作',
        253 => '本地复位操作',
        254 => '本地DO输出操作',
        255 => '传感器短路',
        256 => '传感器断路',
        257 => '传感器错接',
        258 => '三相不平衡异常',
        259 => '485通信故障',
        260 => '有线通信故障',
        261 => 'SIM卡故障',
        262 => '设备拆除',
        263 => '设备号重复',
        264 => '传感器失效',
        265 => '存储芯片坏',
        266 => '氧气一级报警',
        267 => '氧气二级报警',
        268 => '硫化氢一级报警',
        269 => '硫化氢二级报警',
        270 => '一氧化碳一级报警',
        271 => '一氧化碳二级报警',
        272 => '可燃气体一级报警',
        273 => '可燃气体二级报警',
        274 => '线短路故障',
        275 => '线断路故障',
        276 => '电动车充电报警',
        277 => 'A相充电插入',
        278 => 'B相充电插入',
        279 => 'C相充电插入',
        280 => 'N相充电插入',
        281 => 'A相充电拔出',
        282 => 'B相充电拔出',
        283 => 'C相充电拔出',
        284 => 'N相充电拔出',
        285 => '延时',
        286 => '总线故障',
        287 => '阻性漏电报警',
        288 => '容性漏电报警',
        289 => 'A相充电预报警',
        290 => 'B相充电预报警',
        291 => 'C相充电预报警',
        292 => 'N相充电预报警',
        293 => 'AI判断A相充电非真警',
        294 => 'AI判断B相充电非真警',
        295 => 'AI判断C相充电非真警',
        296 => 'AI判断N相充电非真警',
        297 => '一级报警',
        298 => '二级报警',
        299 => 'AI判断充电真警',
        300 => '充电拔出',
        301 => '充电预报警',
        302 => 'AI判断充电非真警',
        303 => '线路连接异常',
        304 => 'A相充电AI报警(平台)',
        305 => 'A相拔出AI报警(平台)',
        306 => 'B相充电AI报警(平台)',
        307 => 'B相拔出AI报警(平台)',
        308 => 'C相充电AI报警(平台)',
        309 => 'C相拔出AI报警(平台)',
        310 => 'N相充电AI报警(平台)',
        311 => 'N相拔出AI报警(平台)',
        312 => '充电AI报警(平台)',
        313 => '拔出AI报警(平台)',
        314 => '红外报警',
        315 => '电池状态报警',
        316 => '防拆报警',
        317 => '故障报警',
        318 => '测试报警',
        319 => '8小时无人报警',
        320 => '12小时无人报警',
        321 => '24小时无人报警',
        322 => '移动侦测告警',
        323 => '温度传感器接线故障',
        324 => '湿度传感器接线故障',
        325 => '电流过低',
        326 => '甲烷可燃气体泄漏',
        327 => '丙烷可燃气体泄漏',
        402 => '电动车充电疑似真警',
    ];

    protected array $saveType = [
        '0' => '故障',
        '1' => '报警',
        '2' => '异常',
        '3' => '操作',
    ];

    protected array $errList = [
        'ErrVal'       => '报警值',
        'SaveType'     => '1操作，2:隐患 3:故障',
        'Node'         => '节点信息',
        'Time'         => '报警时间',
        'IsSave'       => '弃用字段',
        'ErrIsFg'      => '0恢复，1产生',
        'Xh'           => '预留字段',
        'ValUin'       => '报警值的单位',
        'ErrType'      => '报警节点类型',
        'UUID'         => '警情id',

        'id'           => 'ID',
        'modelNo'      => '型号',
        'saveTypeName' => '故障或隐患或操作',
        'errorName'    => '错误类型名',
    ];

    // 两套设备（包括一个子设备）字段对应的单位和描述
    protected array $unitList = [
        'LN6M-L1T4A3V3-H-4G'  => [
            'CL1' => ['容性漏电', 'mA'],
            'BIC' => ['C相谐波电流', 'A'],
            'BIB' => ['B相谐波电流', 'A'],
            'BIA' => ['A相谐波电流', 'A'],
            'BVC' => ['C相谐波电压', 'V'],
            'BVB' => ['B相谐波电压', 'V'],
            'BVA' => ['A相谐波电压', 'V'],
            'ICA' => ['C相电流相位角',	 '°'],
            'IBC' => ['B相电流相位角',	 '°'],
            'DA'  => ['A相功率因数', ''],
            'DB'  => ['B相功率因数', ''],
            'DC'  => ['C相功率因数', ''],
            'RL1' => ['阻性漏电', 'mA'],
            'APC' => ['C相有功功率', 'W'],
            'APB' => ['B相有功功率', 'W'],
            'APA' => ['A相有功功率', 'W'],
            'A3'  => ['C相故障电弧量', '个'],
            'A2'  => ['B相故障电弧量', '个'],
            'A1'  => ['A相故障电弧量', '个'],
            'FA'  => ['电压频率', 'Hz'],
            'IAB' => ['A相电流相位角',	 '°'],
            'VCA' => ['C相电压相位角',	 '°'],
            'IN'  => ['N 相电流/In', 'A'],
            'IC'  => ['C 相电流/Ic', 'A'],
            'IB'  => ['B 相电流/Ib', 'A'],
            'IA'  => ['A 相电流/Ia', 'A'],
            'T4'  => ['N 相温度/Tn', '℃'],
            'T3'  => ['C 相温度/Tc', '℃'],
            'T2'  => ['B 相温度/Tb', '℃'],
            'T1'  => ['A 相温度/Ta', '℃'],
            'VA'  => ['A 相电压/Va', 'V'],
            'VB'  => ['B 相电压/Vb', 'V'],
            'VC'  => ['C 相电压/Vc', 'V'],
            'VBC' => ['B相电压相位角',	 '°'],
            'VAB' => ['A相电压相位角',	 '°'],
            'CSQ' => ['信号强度', 'db'],
            'BI'  => ['3相电流平衡度',	 '%'],
            'BV'  => ['3相电压平衡度',	 '%'],
            'RP'  => ['总无功率', 'W'],
            'AP'  => ['总有功率', 'W'],
            'QT'  => ['总电量', 'KWh'],
            'L1'  => ['剩余电流/L1', 'mA'],
            'FB'  => ['B相电压频率', 'Hz'],
            "FC"  => ['C相电压频率',	'Hz'],
        ],
        'LN6M-L1T4A3V3-D-485' => [
            'BI'  => ['3相电流平衡度',	 '%'],
            'L1'  => ['剩余电流/L1',	'mA'],
            'FA'  => ['电压频率',	'Hz'],
            'DA'  => ['功率因数',	''],
            'BIA' => ['谐波电流',	'A'],
            'BVA' => ['谐波电压',	'V'],
            'RP'  => ['总无功率',	'W'],
            'AP'  => ['总有功率',	'W'],
            'QT'  => ['总电量',	'KWh'],
            'VA'  => ['电压/Va',	'V'],
            'IA'  => ['电流/Ia',	'A'],
            'T4'  => ['N 相温度/Tn',	'℃'],
            'T1'  => ['L 相温度/Ta',	'℃'],
            'A1'  => ['故障电弧量',	'个'],
            'CL1' => ['容性漏电', 'mA'],
            'BIC' => ['C相谐波电流', 'A'],
            'BIB' => ['B相谐波电流', 'A'],
            'BVC' => ['C相谐波电压', 'V'],
            'BVB' => ['B相谐波电压', 'V'],
            'ICA' => ['C相电流相位角',	 '°'],
            'IBC' => ['B相电流相位角',	 '°'],
            'DB'  => ['B相功率因数', ''],
            'DC'  => ['C相功率因数', ''],
            'RL1' => ['阻性漏电', 'mA'],
            'APC' => ['C相有功功率', 'W'],
            'APB' => ['B相有功功率', 'W'],
            'APA' => ['A相有功功率', 'W'],
            'A3'  => ['C相故障电弧量', '个'],
            'A2'  => ['B相故障电弧量', '个'],
            'IAB' => ['A相电流相位角',	 '°'],
            'VCA' => ['C相电压相位角',	 '°'],
            'IN'  => ['N 相电流/In', 'A'],
            'IC'  => ['C 相电流/Ic', 'A'],
            'IB'  => ['B 相电流/Ib', 'A'],
            'T3'  => ['C 相温度/Tc', '℃'],
            'T2'  => ['B 相温度/Tb', '℃'],
            'VB'  => ['B 相电压/Vb', 'V'],
            'VC'  => ['C 相电压/Vc', 'V'],
            'VBC' => ['B相电压相位角',	 '°'],
            'VAB' => ['A相电压相位角',	 '°'],
            'CSQ' => ['信号强度', 'db'],
            'BV'  => ['3相电压平衡度',	 '%'],
            'FB'  => ['B相电压频率', 'Hz'],
            "FC"  => ['C相电压频率',	'Hz'],
        ],
        'LN6M-L1T4A3V3-S-NB'  => [
            'L1'   => ['剩余电流/L1',	'mA'],
            'T1'   => ['A相温度/Ta',	'℃'],
            'T2'   => ['B相温度/Tb',	'℃'],
            'T3'   => ['C相温度/Tc',	'℃'],
            'T4'   => ['N相温度/Tn',	'℃'],
            'IA'   => ['A相电流/Ia',	'A'],
            'IB'   => ['B相电流/Ib',	'A'],
            'IC'   => ['C相电流/Ic',	'A'],
            'VA'   => ['A相电压/Va',	'V'],
            'VB'   => ['B相电压/Vb',	'V'],
            'VC'   => ['C相电压/Vc',	'V'],
            'QA'   => ['A相电量/QA',	'KWH'],
            'QB'   => ['B相电量/QB',	'KWH'],
            'QC'   => ['C相电量/QC',	'KWH'],
            'QT'   => ['三相总正向电量',	'KWH'],
            'PA'   => ['A相视在功率',	'kVA'],
            'PB'   => ['B相视在功率',	'kVA'],
            'PC'   => ['C相视在功率',	'kVA'],
            'DA'   => ['A相功率因数',	''],
            'DB'   => ['B相功率因数',	''],
            'DC'   => ['C相功率因数',	''],
            'FA'   => ['频率',	'Hz'],
            'A1'   => ['A相故障电弧量',	'个'],
            'A2'   => ['B相故障电弧量',	'个'],
            'A3'   => ['C相故障电弧量',	'个'],
            'BV'   => ['三相电压平衡度',	 '%'],
            'BI'   => ['三相电流平衡度',	 '%'],
            'CSQ'  => ['信号强度',	'db'],
            'VAB'  => ['A相电压相位角',	 '°'],
            'VBC'  => ['B相电压相位角',	 '°'],
            'VCA'  => ['C相电压相位角',	 '°'],
            'IAB'  => ['A相电流相位角',	 '°'],
            'IBC'  => ['B相电流相位角',	 '°'],
            'ICA'  => ['C相电流相位角',	 '°'],
            'MXP'  => ['大功率报警值',	'W'],
            'APA'  => ['A相有功功率',	'kW'],
            'APB'  => ['B相有功功率',	'kW'],
            'APC'  => ['C相有功功率',	'kW'],
            'AP'   => ['总有功功率',	'kW'],
            'RPA'  => ['A相无功功率',	'kvar'],
            'RPB'  => ['B相无功功率',	'kvar'],
            'RPC'  => ['C相无功功率',	'kvar'],
            'RP'   => ['总无功功率',	'kvar'],
            'PQ0'  => ['上时总正向电量',	'KWH'],
            'PQ0T' => ['上时总正向电量时间',	''],
            'PQ1'  => ['当时总正向电量',	'KWH'],
            'PQ2'  => ['上日总正向电量',	'KWH'],
            'PQ3'  => ['当日总正向电量',	'KWH'],
            'PQ4'  => ['上月总正向电量',	'KWH'],
            'PQ5'  => ['当月总正向电量',	'KWH'],
            'PP0'  => ['上日功率总正向最大需量',	'KW'],
            'PP0T' => ['上日功率总正向最大需量时间',	''],
            'PP1'  => ['当日功率总正向最大需量',	'KW'],
            'PP1T' => ['当日功率总正向最大需量时间',	''],
            'PP2'  => ['上月功率总正向最大需量',	'KW'],
            'PP2T' => ['上月功率总正向最大需量时间',	''],
            'PP3'  => ['当月功率总正向最大需量',	'KW'],
            'PP3T' => ['当月功率总正向最大需量时间',	''],
            'XBA'  => ['A相电压谐波含量',	'%'],
            'XBB'  => ['B相电压谐波含量',	'%'],
            'XBC'  => ['C相电压谐波含量',	'%'],
            'XBV'  => ['三相总电压谐波含量',	'%'],
            'XB1'  => ['A相电流谐波含量',	'%'],
            'XB2'  => ['B相电流谐波含量',	'%'],
            'XB3'  => ['C相电流谐波含量',	'%'],
            'XBI'  => ['三相总电流谐波含量',	'%'],
        ],
    ];

    /**
     * Execute the console command.
     *
     * @return int
     * @throws DataTransferException
     * @throws InvalidMessageException
     * @throws MqttClientException
     * @throws ProtocolViolationException
     * @throws RepositoryException
     */
    public function handle()
    {
        $this->line('welcome to happy bird MQTT client!');
        try {
            $mqtt = MQTT::connection();
            $date = now();
            // 报警
            $mqtt->subscribe('lnsendout/ruyue_mqtt/+/+/alarm/#', function (string $topic, string $message) use ($date) {
                $json       = json_decode($message, true);
                $topicArray = explode('/', $topic);

                $modelNo = $topicArray[2]; // 型号
                $id      = $topicArray[3]; // 编号

                $uuid = 'null';

                foreach ($json['ErrList'] as &$error) {
                    foreach ($this->warmTypes as $key => $warmType) {
                        if ($error['ErrType'] == $key) {
                            $error['errorName']    = $warmType;
                            $error['saveTypeName'] = $this->saveType[$error['SaveType']];
                            $error['id']           = $id;
                            $error['modelNo']      = $modelNo;

                            $errorArray = [
                                ["name" => "type", "value" => $error['errorName'], "desc" => "告警类型"],
                            ];
                            foreach ($error as $name => $err) {
                                if ($name === "UUID") {
                                    $uuid = $err;
                                }
                                $errorArray[] = [
                                    'name'  => $name,
                                    'value' => $err,
                                    'desc'  => $this->errList[$name] ?? '',
                                ];
                            }
                            // 由于ErrList有多条，如果是漏电，过载，过热，电瓶车的情况，则每条分开打印，分开处理todo
                            if (in_array(
                                $error['ErrType'],
                                [5, 30, 6, 277, 278, 279, 280, 281, 282, 283, 284, 289, 290, 291, 292, 293, 294, 295, 296, 299, 300, 301, 302, 304, 306, 308, 310, 312, 402]// 添加电动车报警
                            )) {
                                $time       = Carbon::now(); // 获取当前时间
                                $format     = 'Y-m-d\TH:i:s.uP'; // 设置指定的时间格式
                                $timeString = $time->format($format); // 格式化时间

                                $log_message = "[{$timeString}] 报警: {$error['ErrType']}/{$modelNo}/{$id}/{$date}/" . json_encode($errorArray);
                                $log_file    = "storage/logs/alarm/" . $uuid . ".log";
                                file_put_contents($log_file, $log_message);
                            }
                        }
                    }
                }
                $message = json_encode($json);
                // 也可以打印所有的ErrList(留底)
                Log::info("Received all alarm message:{$date} {$message} on topic {$topic}");
                // 对data进行处理
            }, 1);

            // 心跳
            $mqtt->subscribe('lnsendout/ruyue_mqtt/+/+/rtdata/#', function (string $topic, string $message) use ($date) {
                $topicArray = explode('/', $topic);

                // topic:lnsendout/ruyue_mqtt/LN6M-L1T4A3V3-H-4G/869324057508552/rtdata/h.1.2.1|s.1.3.1
                $modelNo = $topicArray[2]; // 型号
                $id      = $topicArray[3]; // 编号

                $units    = json_decode($message);
                $newArray = [
                    ["name" => "type", "value" => "心跳", "desc" => "告警类型"],
                ];
                foreach ($units as $unit => $value) {
                    // 单位名
                    $newArray[] = [
                        'name'  => $unit,
                        'desc'  => $this->unitList[$modelNo][$unit][0],
                        'value' => $value,
                        'unit'  => $this->unitList[$modelNo][$unit][1],
                    ];
                }
                $data = json_encode($newArray);
                Log::info("Received tdata message:{$modelNo}/{$id}/{$date}{$message} on topic {$topic}");
                $time       = Carbon::now(); // 获取当前时间
                $format     = 'Y-m-d\TH:i:s.uP'; // 设置指定的时间格式
                $timeString = $time->format($format); // 格式化时间

                $log_message = "[{$timeString}] 心跳包:{$modelNo}/{$id}/{$date}/{$data}";
                $log_file    = "storage/logs/heartbeat/" . $id . microtime(true) . ".log";
                file_put_contents($log_file, $log_message);
            }, 1);
            $mqtt->loop(true);// 不退出
        } catch (ClientNotConnectedToBrokerException $e) {
            $this->error('Failed to establish connection to MQTT server,error message:' . $e);
        }
    }
}
