<?php

namespace App\Models\Platform;

use App\Models\BaseModel;

class CellInfo extends BaseModel
{
    protected $table = 'cell_info';
    public $timestamps = null;

    public static array $cellStatus = [
        '0' => '离网',
        '1' => '空闲',
        '2' => '占用（未充电）',
        '3' => '占用（充电中）',
        '4' => '占用（预约锁定）',
        '5' => '占用（充电完成）',
        '255' => '离网',
    ];

    public static array $doorStatus = [
        '0' => '未知',
        '10' => '关闭',
        '50' => '打开',
    ];

    public static array $errorCode = [
        '1000' => '正常工作',
        '1001' => '设备未回复电压电流功率',
        '1002' => '设备未回复错误状态',
        '1003' => '电表故障',
        '1004' => '设备故障',
        '1005' => '欠压告警',
        '1006' => '过压告警',
        '1007' => '过流保护',
        '1008' => '离线告警',
        '1009' => '漏电流异常告警',
        '1010' => '输出短路告警',
        '1011' => '电表异常',
        '1012' => '无效回应',
        '1013' => '无效参数',
        '1014' => '接收超时',
        '1015' => '过温报警',
        '1016' => '超过最大功率',
        '1017' => '设备离线',
        '2001' => 'BID错误',
        '2002' => '风扇故障',
        '2003' => '风扇信号故障',
        '2004' => '电源模块故障',
        '2005' => '电源模块校准错误',
        '2006' => 'ACC故障',
        '2007' => '高温报警',
        '2008' => '烟雾报警',
        '2009' => '电流波动异常',
        '2010' => '电流采样故障',
        '2011' => '电源故障',
        '2012' => '测试模块失败',
        '2013' => '测试继电器故障',
        '2014' => '测试风扇异常',
        '2015' => '测试开门失败',
        '2016' => '测试温度异常',
        '2017' => '异常开门',
        '2018' => '门锁故障',
        '2019' => '电池拔出',
        '2020' => '回应失效',
        '2021' => '未知类型电池',
        '2022' => '电池未连接',
        '2023' => '开门失败',
        '2024' => '无此订单',
        '2025' => '充电电压小于电池电压',
        '2026' => '充电故障',
        '2027' => '电池电压小于充电电压',
        '2028' => '电池未连接',
        '2029' => '恒流阶段电压异常',
        '2030' => '恒压阶段电流异常',
        '2031' => '禁止充电时段',
        '2033' => '订单无效',
        '2034' => '设备繁忙',
        '2035' => '初始状态',
        '2036' => '灭火装置报警',
    ];
}
