<?php

namespace App\Models\Platform;

use App\Models\BaseModel;

class ChargingRecord extends BaseModel
{
    protected $table = 'charging_record';
    public $timestamps = null;

    public static array $stopReason = [
        "0" => '按照充电服务类型正常停止充电',
        "1" => '用户本地刷卡停止充电',
        "2" => '用户远程结束充电',
        "3" => '平台远程结束充电',
        "4" => '检测到枪头断开而停止充电',
        "5" => '检测到充电桩掉电而停止充电',
        "6" => '检测到充电桩故障而停止充电',
        "7" => '检测到电动车故障而停止充电',
        "8" => '其它原因停止充电',
        "9" => '检测到充满停止充电',
        "10" => '检测到余额不足而停止充电',
        "11" => '过载停止',
        "12" => '过压停止',
        "13" => '欠压停止',
        "14" => '整桩实时功率过大停止充电',
        "15" => '手机蓝牙停止',
        "16" => '设备接地故障',
        "17" => '设备温度过高',
        "18" => '未关闭柜门',
        "19" => '电池温度异常',
        "20" => '电池电压异常',
        "21" => '电池温差超过阈值',
        "22" => '电池压差超过阈值',
        "23" => '功率异常浮动停止充电',
        "24" => '超时结束充电（电量充电时超时（720分钟））'
    ];
}
