<?php

namespace App\Http\Server\Hikvision;

class AreaCodeServer
{
    public static $cityCode = [
        '江高镇'   => 1000005,
        '江兴社区'  => 410,
        '高塘社区'  => 411,
        '松岗社区'  => 412,
        '河心洲社区' => 413,
        '江华社区'  => 414,
        '广北社区'  => 415,
        '金沙社区'  => 416,
        '神山社区'  => 417,
        '石龙社区'  => 418,
        '南山社区'  => 419,
        '塘贝村'   => 420,
        '水沥村'   => 421,
        '长岗村'   => 422,
        '新楼村'   => 423,
        '双岗村'   => 424,
        '茅山村'   => 425,
        '蓼江村'   => 426,
        '小塘村'   => 427,
        '何布村'   => 428,
        '大田村'   => 429,
        '南岗村'   => 430,
        '珠江村'   => 431,
        '江村村'   => 432,
        '大龙头村'  => 433,
        '泉溪村'   => 434,
        '叶边村'   => 435,
        '沙溪村'   => 436,
        '勤星村'   => 437,
        '大岭村'   => 438,
        '郭塘村'   => 439,
        '沙龙村'   => 440,
        '聚龙村'   => 441,
        '大石岗村'  => 442,
        '杨山村'   => 443,
        '鹤岗村'   => 444,
        '硖石村'   => 445,
        '朗头村'   => 446,
        '两上村'   => 447,
        '两下村'   => 448,
        '五丰村'   => 449,
        '中八村'   => 450,
        '雄丰村'   => 451,
        '南浦村'   => 452,
        '罗溪村'   => 453,
        '井岗村'   => 454,
        '如约设备组'   => 6666,
    ];

    public static function getAreaCode($nodeName)
    {
        $nodeName = match ($nodeName) {
            '神山消防救援专职队' => '神山社区',
            '高唐社区' => '高塘社区',
            '泉溪村委' => '泉溪村',
            '五丰村委' => '五丰村',
            '朱江村委' => '珠江村',
            '茅山村委' => '茅山村',
            '何㘵村委','何㘵村新庄经济合作社','何㘵村上庄经济合作社','何㘵村南一经济合作社','何㘵村南二经济合作社','何㘵村叶家经济合作社','何㘵村大巷经济合作社','何㘵村细巷经济合作社','何㘵村蔡南经济合作社','何㘵村蔡北经济合作社','何㘵村东头经济合作社','何㘵村西边经济合作社' => '何布村',
            default => $nodeName,
        };
//        print_r($nodeName);
        return self::$cityCode[$nodeName] ?? '6666';
    }
}
