<?php

namespace App\Http\Server\Hikvision;

class AreaCodeServer
{
    public static $cityCode = [
        '江高镇'   => 1000005,
        '江兴社区'  => 410,
        '高塘社区'  => 411,
        '松岗社区'  => 412,
        '河心洲社区' => 413,
        '江华社区'  => 414,
        '广北社区'  => 415,
        '金沙社区'  => 416,
        '神山社区'  => 417,
        '石龙社区'  => 418,
        '南山社区'  => 419,
        '塘贝村'   => 420,
        '水沥村'   => 421,
        '长岗村'   => 422,
        '新楼村'   => 423,
        '双岗村'   => 424,
        '茅山村'   => 425,
        '蓼江村'   => 426,
        '小塘村'   => 427,
        '何布村'   => 428,
        '大田村'   => 429,
        '南岗村'   => 430,
        '珠江村'   => 431,
        '江村村'   => 432,
        '大龙头村'  => 433,
        '泉溪村'   => 434,
        '叶边村'   => 435,
        '沙溪村'   => 436,
        '勤星村'   => 437,
        '大岭村'   => 438,
        '郭塘村'   => 439,
        '沙龙村'   => 440,
        '聚龙村'   => 441,
        '大石岗村'  => 442,
        '杨山村'   => 443,
        '鹤岗村'   => 444,
        '硖石村'   => 445,
        '朗头村'   => 446,
        '两上村'   => 447,
        '两下村'   => 448,
        '五丰村'   => 449,
        '中八村'   => 450,
        '雄丰村'   => 451,
        '南浦村'   => 452,
        '罗溪村'   => 453,
        '井岗村'   => 454,
    ];

    public static function getAreaCode($area)
    {
        return self::$cityCode[$area] ?? '1000005';
    }
}
